wiciu15/NRF51_CAN_BLE_HID_Multimedia/src/main.c
        case PM_EVT_STORAGE_FULL:
        {
            // Run garbage collection on the flash.
            err_code = fds_gc();
            if (err_code == FDS_ERR_BUSY || err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
            {
                // Retry.
            }
            else
            {
                APP_ERROR_CHECK(err_code);
            }
        } break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
        {
            advertising_start();
        } break;

        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
        {
            // The local database has likely changed, send service changed indications.
            pm_local_database_has_changed();
        } break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_data_update_failed.error);
        } break;

        case PM_EVT_PEER_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
        } break;

        case PM_EVT_PEERS_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
        } break;

        case PM_EVT_ERROR_UNEXPECTED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
        } break;

        case PM_EVT_CONN_SEC_START:
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        case PM_EVT_PEER_DELETE_SUCCEEDED:
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
        case PM_EVT_SERVICE_CHANGED_IND_SENT:
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
        default:
            break;
    }
}


/**@brief Function for handling Service errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void service_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling advertising errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void ble_advertising_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for performing a battery measurement, and update the Battery Level characteristic in the Battery Service.
 */
static void battery_level_update(void)
{
    uint32_t err_code;
    uint8_t  battery_level;

    battery_level = 69;

    err_code = ble_bas_battery_level_update(&m_bas, battery_level);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_NO_TX_PACKETS) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_HANDLER(err_code);
    }
}


/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update();
}

/**@brief Function for sending a report with given multimedia key pressed
 *
 * @details Function sends HID report with appropriate key pressed and triggers one-shot timer which sends an empty report (all key release) after few ms
 */
static void hid_multimedia_send_key(uint8_t key){
	uint8_t report[3]={0x01,0,0}; //empty hid report with no keys pressed
	    report[1] |= 1<<key;
	    uint32_t err_code = ble_hids_inp_rep_send(&m_hids,
	                                                 INPUT_REPORT_KEYS_INDEX,
	                                                 INPUT_REPORT_KEYS_MAX_LEN,
	                                                 report);
	    app_timer_start(m_key_release_interval_id,KEY_RELEASE_REPORT_INTERVAL,NULL); //send empty report after a delay to simulate key release
}


static void key_release_timer_timeout_handler(void * p_context){
	UNUSED_PARAMETER(p_context);
	    uint8_t report[3]={0x01,0,0}; //hid report with no keys pressed
	    uint32_t err_code = ble_hids_inp_rep_send(&m_hids,
	                                                 INPUT_REPORT_KEYS_INDEX,
	                                                 INPUT_REPORT_KEYS_MAX_LEN,
	                                                 report);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module, making it use the scheduler.
    APP_TIMER_APPSH_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, true);

    // Create battery timer.
    err_code = app_timer_create(&m_battery_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_level_meas_timeout_handler);
    err_code = app_timer_create(&m_key_release_interval_id,APP_TIMER_MODE_SINGLE_SHOT,key_release_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);


}

/**@brief Handler for MCP2515 INT pin external interrupt
 *
 * @details This function reads can frame from MCP2515 RX buffer and triggers appropriate action based on can frame data
 */
static void mcp2515_int_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action){
	mcp2515_rx(&received_can_frame);
	NRF_LOG_INFO("CAN RX id%X data0x%X \r\n",received_can_frame.can_id,(received_can_frame.data[0]))
	if(received_can_frame.data[0]==CAN_MEDIA_NEXT){
		hid_multimedia_send_key(MEDIA_NEXT);
	}
	if(received_can_frame.data[0]==CAN_MEDIA_PREV){
		hid_multimedia_send_key(MEDIA_PREV);
	}
}

/**@brief Function for GPIOTE and interrupt pins configuration.
 *
 * @details This function sets up GPIOTE peripheral and configures interrupt pin for use with MCP2515
 */
static void gpiote_init(void){
	ret_code_t err_code;

	err_code = nrf_drv_gpiote_init();
	APP_ERROR_CHECK(err_code);

